app/views/users/show.html.erb

      <div class="span8">
        <% if @user.messages.any? %>
---
SELECT 1 AS one FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]

    <div class = "span8">
      <% if @user.listings.any? %>
---
SELECT 1 AS one FROM "listings" WHERE "listings"."user_id" = $1 ORDER BY created_at DESC LIMIT 1  [["user_id", 1]]