app/controllers/messages_controller.rb

	def create
		@messages = current_user.messages.build(message_params)
	    if @messages.save
---
INSERT INTO "messages" ("Body", "FromUserId", "SubjectTitle", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def destroy
		@messages = Message.find(params[:id])
    	if @messages.present?
      		@messages.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 4]]