app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1 ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @listings = @user.listings.paginate(page: params[:page], per_page: 10)
    @messages = @user.messages.paginate(page: params[:page])

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "remember_token", "updated_at", "username", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save